// Пример, как должна выглядеть структура какдого из вида вопроса.

let allQuestions = [
    {
        type: 0,    // Тип вопроса
        price: 100, // Цена вопроса
        text: 'Текст закрытого вопроса. 1 вариант ответа',  // Текст вопроса
        image: false, // Имеется ли у него картинка/картинки? Может содержать true.
        answers: ['Вариант 1', 'Вариант 2', 'Вариант 3', 'Вариант 4'],  // Варианты ответов
        correctAnswer: [0], // Массив верных ответов
        answered: null, // Флаг, ответили ли на этот вопрос
    },
    {
        type: 1, // Тип вопроса
        price: 150, // Цена вопроса
        text: 'Текст закрытого вопроса. Несколько вариантов ответа',    // Текст вопроса
        image: false,   // Имеется ли у него картинка/картинки? Может содержать true.
        answers: ['Вариант 1', 'Вариант 2', 'Вариант 3', 'Вариант 4', 'Вариант 5', 'Вариант 6'], // Варианты ответов
        correctAnswer: [0,1,2], // Массив верных ответов
        answered: null, // Флаг, ответили ли на этот вопрос
    },
    {
        type: 2, // Тип вопроса
        price: 200, // Цена вопроса
        text: 'Вставте пропущенные слова:', // Текст вопроса
        // Текст тела вопроса. В местах где "|" будет вставлен dropdown с выбором.
        textDd: "Семен Морозов родился в |. Он разработал свою первую штуку в | году. Благодаря этой разработке, все | мира могут спать спокойно",
        answers: [["Узбекистане", "Ираке", "России"],   // Варианты ответов. Каждый разделен на под массив изходя из типа вопроса
                ["1950","3572","824"],
                ["коты","жители","суслики"]],
        correctAnswer: [2,0,1], // Массив верных ответов
        answered: null, // Флаг, ответили ли на этот вопрос
    },
    {
        type: 3, // Тип вопроса
        price: 250, // Цена вопроса
        text: 'Установите соответствие между названием насадки и изображением.',    // Текст вопроса
        image: false, // Имеется ли у него картинка/картинки? Может содержать true.
        answers: ["Кольца Рашига","Кольца с крестообразной перегородкой","Кольца Палля","Кольца Лессинга"],// Варианты ответов.
        correctAnswer: [1,2,3,0],   // Массив верных ответов
        answered: null, // Флаг, ответили ли на этот вопрос
    },
    {
        type: 4, // Тип вопроса
        price: 300, // Цена вопроса
        text: 'Распределите виды насадочных элементов в соответствии с предложенной классификацией.',   // Текст вопроса
        tables: ["Регулярная насадка","Нерегулярная насадка"], // Названия таблиц
        answers: ["1","2","3","4","5","6","7","8","9","10","11"], // Массив ответов
        correctAnswer: [[0,1,2],[3,4,5,6,7,8,9,10]],    // Массив верных ответов
        answered: null, // Флаг, ответили ли на этот вопрос
    },
    {
        type: 5, // Тип вопроса
        price: 350, // Цена вопроса
        text: 'Определите элементы насадочной колонны.',    // Текст вопроса
        image: false, // Имеется ли у него картинка/картинки? Может содержать true.
        answers: ["Распределительное устройство","Насадка","Опорная решетка","Распределитель жидкости","Направляющий конус"],
        correctAnswer: [0,1,2,3,4],     // Массив верных ответов
        answered: null, // Флаг, ответили ли на этот вопрос
    },
]; 